// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "請輸入下列密碼，然後按下鍵盤上的 Return 鍵。";

"MSG_PAIRING_TIMEOUT" = "無法與“%@”配對。請按“配對”一下再試一次。";
"MSG_PAIRING_TIMEOUT_AUTO" = "無法與“%@”配對。請在 5 秒後再與下一個鍵盤進行配對。";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "無法與%@”配對。請在 5 秒後再試一次。";

"MSG_PAIRING_FAILED" = "無法與您的鍵盤配對。請按“配對”一下再試一次。";
"MSG_PAIRING_FAILED_AUTO" = "無法與您的鍵盤配對。請再試一次⋯";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "搜尋您的無線設備時發生問題。";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "正在與鍵盤“%@”配對。";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "正在與滑鼠“%@”配對。";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "正在搜尋您的鍵盤⋯";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "正在搜尋您的滑鼠⋯";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "您的電腦已經與“%@”配對成功。";
"TITLE_PAIRED_MOUSE" = "您的電腦已經與“%@”配對成功";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "“輔助設定程式”找到 %d 個無線鍵盤。";
"TITLE_MOUSE_N_FOUND" = "“輔助設定程式”找到 %d 個無線鍵盤。";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "“設定輔助程式”已找到名為“%@”的鍵盤。";
"TITLE_MOUSE_FOUND" = "“設定輔助程式”已找到名為“%@”的滑鼠。";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "請從列表裡選擇您的鍵盤，然後按“配對”一下。當配對成功時，您會看到密碼，請在鍵盤上輸入。";
"MSG_START_PAIRING_MOUSE" = "“設定輔助程式”正在嘗試與列表裡每個滑鼠配對。當配對成功時，您就可以使用滑鼠來移動指標。";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "與“%@”配對的作業將自動開始。當配對成功時，您會看到密碼，請在鍵盤上輸入。";
"MSG_START_PAIRING_MOUSE_SINGLE" = "與“%@”配對的作業將自動開始。當配對成功時，您就可以使用滑鼠來移動指標。";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "找不到鍵盤。正在搜尋⋯";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "找不到滑鼠。正在搜尋⋯";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "您的電腦未連接任何鍵盤。請立即接上鍵盤。";
"MSG_NO_MOUSE" = "您的電腦未連接任何滑鼠。請立即接上滑鼠。";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "您的電腦未連接任何鍵盤。請立即接上鍵盤。\n\n若使用的是 Apple Wireless Keyboard 無線鍵盤，請確定電池放入正確且鍵盤已啟用。";
"MSG_NO_MOUSE_BLUETOOTH" = "您的電腦未連接任何滑鼠，請立即接上滑鼠。\n\n若使用的是 Apple Wireless Mouse 無線滑鼠，請找出滑鼠底部的開關，並推開底蓋來打開滑鼠電源並讓 LED 露出來。\n\n若不使用滑鼠，請立即接上鍵盤。";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "更在更新 %d 個鍵盤名稱⋯";
"MSG_GETTING_MOUSE_NAMES" = "正在更新 %d 個滑鼠名稱⋯";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "若要確認配對，請按下鍵盤上的 Return 鍵。如果您不按下 Return 鍵，配對將會在 %d 秒後重新開始。";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "若要確認配對，請使用滑鼠按下方顯示的“好”按鈕一下。如果您不按下滑鼠按鈕，配對將會在 %d 秒後重新開始。";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "您輸入的密碼不正確。請按“配對”一下再試一次。";
"MSG_AUTH_FAILURE_MOUSE" = "與您的滑鼠配對不成功。請按“配對”一下再試一次。";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "您輸入的密碼不正確。請在 5 秒後再與您的鍵盤配對。";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "與您的滑鼠配對不成功。請在 5 秒後再與您的滑鼠配對。";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "正在等待您的鍵盤連接⋯";
"MSG_ALREADY_PAIRED_MOUSE" = "按您的滑鼠一下來開始使用。";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "若這不是您的滑鼠，請確定您的滑鼠已啟用，然後等待搜尋再次開始。";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "若這不是您的鍵盤，請確定您的鍵盤已啟用，然後等待搜尋再次開始。";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "若您的滑鼠不在列表中，請確定滑鼠已啟用，然後等待搜尋再次開始。";
"MSG_WARNING_PAIRING_KEYBOARD" = "若您的鍵盤不在列表中，請確定鍵盤已啟用，然後按“取消”一下來重新搜尋。";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "如果移動您的滑鼠時，指標沒有跟著移動，表示滑鼠並未與電腦配對成功。請等待配對重新開始。";
"MSG_WARNING_ACK_KEYBOARD" = "如果按下鍵盤上的 Return 鍵沒有確認配對，表示鍵盤並未與電腦配對成功。請等待配對重新開始。";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "正在與您的設備配對⋯";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "正在連接⋯";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "已連接。";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "已完成配對。";

"CUSTOM_MOUSE_NAME"	= "%@ 的滑鼠";
"CUSTOM_KEYBOARD_NAME"	= "%@ 的鍵盤";

